# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'borkdude/brew'
tap 'azure/functions'

# Binaries
brew 'awscli'
brew 'azure-functions-core-tools@4'
brew 'bash' # Latest Bash version
brew 'clojure'
brew 'clj-kondo'
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'leiningen'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'openjdk'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'python3'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'alfred'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'github'
cask 'gpg-suite'
cask 'hey'
cask 'iterm2'
cask 'microsoft-teams'
cask 'notion'
cask 'phpmon'
cask 'phpstorm'
cask 'postman'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'telegram-desktop'
cask 'whatsapp'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Bear', id: 1091189122
mas 'GoodNotes 5', id: 1444383602
